Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/gcc/gcc/startup_pic32cz8110ca80100.c
/**
 * \file
 *
 * \brief GCC startup file for PIC32CZ8110CA80100
 *
 * Copyright (c) 2022 Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

#include "pic32cz8110ca80100.h"

/* Initialize segments */
extern uint32_t _sfixed;
extern uint32_t _efixed;
extern uint32_t _etext;
extern uint32_t _srelocate;
extern uint32_t _erelocate;
extern uint32_t _szero;
extern uint32_t _ezero;
extern uint32_t _sstack;
extern uint32_t _estack;

/* Optional application-provided functions */
extern void __attribute__((weak,long_call)) _on_reset(void);
extern void __attribute__((weak,long_call)) _on_bootstrap(void);

/** \cond DOXYGEN_SHOULD_SKIP_THIS */
int main(void);
/** \endcond */

void __libc_init_array(void);

/* Reset handler */
void Reset_Handler(void);

/* Default empty handler */
void Dummy_Handler(void);

/* Cortex-M7 core handlers */
void NonMaskableInt_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void HardFault_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void MemoryManagement_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void BusFault_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void UsageFault_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SVCall_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DebugMonitor_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PendSV_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SysTick_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));

/* Peripherals handlers */
void FCW_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void FCR_ECCERR_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void FCR_CRC_FAULT_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PM_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SUPC_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSCCTRL_FAIL_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSCCTRL_XOSCRDY_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSCCTRL_DFLLRDY_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSCCTRL_OTHER_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSCCTRL_LOCK_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSC32KCTRL_FAIL_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSC32KCTRL_RDY_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void MCLK_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void FREQM_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void WDT_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RTC_TAMPER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RTC_OVF_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RTC_PERIOD_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RTC_COMPARE_Handler  ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_0_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_1_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_2_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_3_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_4_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_5_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_6_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_7_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_8_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_9_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_10_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_11_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_12_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_13_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_14_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_15_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PAC_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DRMTCM_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void MCRAMC_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TRAM_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_PRI3_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_PRI2_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_PRI1_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_PRI0_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_0_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_1_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_2_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_3_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_4_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_5_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_6_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_7_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_8_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_9_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_10_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_11_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_6_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_5_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_6_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_5_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_6_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_5_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_6_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_5_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_CNT_TRIG_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC0_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC1_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC2_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC3_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC4_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC5_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC6_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC7_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_CNT_TRIG_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC0_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC1_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC2_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC3_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC4_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC5_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC6_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC7_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_CNT_TRIG_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC0_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC1_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC2_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC3_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC4_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC5_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_CNT_TRIG_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_MC0_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_MC1_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC4_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC4_CNT_TRIG_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC4_MC0_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC4_MC1_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC5_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC5_CNT_TRIG_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC5_MC0_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC5_MC1_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC6_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC6_CNT_TRIG_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC6_MC0_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC6_MC1_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC7_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC7_CNT_TRIG_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC7_MC0_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC7_MC1_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC8_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC8_CNT_TRIG_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC8_MC0_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC8_MC1_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_CNT_TRIG_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_MC0_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_MC1_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_MC2_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_MC3_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_MC4_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC9_MC5_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_GLOBAL_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_CORE1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_CORE2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_CORE3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_CORE4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void AC_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PTC_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SPI_IXS0_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAN0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAN1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ETH_PRI_Q_0_Handler  ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ETH_PRI_Q_1_Handler  ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ETH_PRI_Q_2_Handler  ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ETH_PRI_Q_3_Handler  ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ETH_PRI_Q_4_Handler  ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ETH_PRI_Q_5_Handler  ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SQI0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TRNG_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SDMMC0_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void USBHS0_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void MLB_GENERAL_Handler  ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void MLB_BUSREQ_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));

/* Exception Table */
__attribute__ ((section(".vectors")))
const DeviceVectors exception_table = {

        /* Configure Initial Stack Pointer, using linker-generated symbols */
        .pvStack = (void*) (&_estack),

        .pfnReset_Handler              = (void*) Reset_Handler,
        .pfnNonMaskableInt_Handler     = (void*) NonMaskableInt_Handler,
        .pfnHardFault_Handler          = (void*) HardFault_Handler,
        .pfnMemoryManagement_Handler   = (void*) MemoryManagement_Handler,
        .pfnBusFault_Handler           = (void*) BusFault_Handler,
        .pfnUsageFault_Handler         = (void*) UsageFault_Handler,
        .pvReservedC9                  = (void*) (0UL), /* Reserved */
        .pvReservedC8                  = (void*) (0UL), /* Reserved */
        .pvReservedC7                  = (void*) (0UL), /* Reserved */
        .pvReservedC6                  = (void*) (0UL), /* Reserved */
        .pfnSVCall_Handler             = (void*) SVCall_Handler,
        .pfnDebugMonitor_Handler       = (void*) DebugMonitor_Handler,
        .pvReservedC3                  = (void*) (0UL), /* Reserved */
        .pfnPendSV_Handler             = (void*) PendSV_Handler,
        .pfnSysTick_Handler            = (void*) SysTick_Handler,

